src/test/java/io/github/mariazevedo88/sbwsexample/test/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cal="http://io.github.mariazevedo88/types/calculator">
    <soapenv:Header/>
    <soapenv:Body>
        <cal:AdditionInput>
            <cal:number1>2</cal:number1>
            <cal:number2>4</cal:number2>
        </cal:AdditionInput>
    </soapenv:Body>
</soapenv:Envelope>